* 피드백 주기가 짧으면 문제를 신속하게 파악할 수 있어 상황 파악도, 적응도 빠르다. 애자일은 문제 자체를 해결해주지는 않는다. 애자일은 문제를 드러나게 한다.

* 소프트웨어 장인정신은 마스터가 되어가는 긴 여정이다. 소프트웨어 장인정신은 소프트웨어 개발자가 스스로가 선택한 커리어에 책임을 가지고, 지속적으로 새로운 도구와 기술을 익히며 발전하겠다는 마음가짐이다. 소프트웨어 장인정신은 책임감, 프로페셔널리즘, 실용주의 그리고 소프트웨어 개발자로서의 자부심을 의미한다.

* 좋은 소프트웨어라면 그 애플리케이션이 얼마나 오래되었든 간에 개발자가 쉽게 이해할 수 있어야 한다.

* 보이스카웃에는 캠핑 장소를 처음 발견했을 때보다 더 깨끗하게 남겨두라는 규율이 있다. 이는 소프트웨어에도 똑같이 적용할 수 있다. 코드도 처음 발견했을 때보다 더 깨끗하게 관리해야 한다.

* 도요타가 성공할 수 있었던 중요한 요인은 절차를 개선하는 것뿐만 아니라 자동차의 품질에 이미 충분한 역량과 그를 뒷받침하는 노력이 있었기 때문이다.

* 일을 할 떄의 방법은 그 실행 결과만큼이나 중요하다. 품질이 좋은 코드를 능숙하게 작성하고 싶다면 높은 품질의 고드를 작성하는 방법을 훈련해야 한다. 훈련 외의 다른 수단은 없다. 훈련을 할 때는 문제의 해결 자체가 아니라 해결에 사용한 테크닉에 집중해야 한다.

* 급여를 받는 이유는 문제 해결에 사용한 테크닉이 아니라 문제 해결 자체에 대한 대가이지만, 훈련을 할 때는 그 문제를 '어떻게' 해결하는지가 중요하다. 

* 빡빡한 일정을 다루는 가장 좋은 방법은 필요한 모든 것을 분석하여 가능한 위험과 우려사항을 터놓고 관계자들과 소통하는 것이다. 불명확하거나 불편한 사실들, 우려사항을 터놓고 관계자들과 소통하는 것이다. 

* 개발자들이 어떤 기능을 개발할 수 없다고 부정적인 이야기를 할 떄 관리자들은 고맙게 생각해야 한다. 좋은 소식은 아니지만 그러한 솔직함으로 인해 더 큰 문제를 피할 수 있다.

* 프로그래밍은 집을 짓는다기보다는 정원을 돌보는 것에 더 가깝다.

* 몇 주나 몇 개월 이상 유지보수를 해야 하는 소프트웨어라면, 품질을 희생해서라도 빨리 끝낼 수 있다는 것은 어쩌면 환상이라고 생각한다. 많은 기업들이 자신의 소프트웨어에 인질로 잡혀 있다. 소프트웨어가 얼마나 빨리 변경 또는 개선될 수 있느냐에 따라 비즈니스의 민첩성이 드러난다. 소프트웨어의 품질이 좋지 않을수록 변경하기가 더 어려워진다. 기업이 사용하는 소프트웨어의 개선이나 변경이 느릴수록 시장 환경의 변화에 기업이 대응하는 속도도 떨어진다. 회사와 개발자들은 정기적으로 도끼날을 가는 시간이 낭비가 아니라는 사실을 이해해야 한다. 바로 그것이 시간을 절약하고 끊임없이 빨리 움직일 수 있는 최선의 방법이다.

* 실행 관례를 도입 또는 팀에 강제적으로 적용한다고 해서 프로젝트의 성공을 보증하지 않는다. 사람은 우리가 원하는대로 행동하도록 프로그램할 수 있는 기계가 아니다. 단순히 준수할 실행 관례를 공표했다고 해서 기대하는 결과가 나오지 않는다. (중략) 실행 관례가 효율적이려면 반드시 모든 팀 구성원들에 의해서 그 가치가 납득되어야 한다.

* 몇 년 동안 바뀐적이 없는 부분을 리펙토링하는 것은 의미가 없다. 애당초 코드를 수정할 필요가 없다면 리펙토링해야 할 이유도 없다. 리펙토링은 더 자주 변경되는 부분을 대상으로 시작한다. (중략) 유지보수가 쉬운 깨끗한 코드는 개발 속도를 높이고 버그가 만들어질 가능성을 낮춘다. 이것이 리펙토링의 비즈니스적인 가치이다.

* 지식 노동자를 움직이는 것은 자율성, 통달, 목적의식 이렇게 세 가지라고 이야기하고 있다. 자율성: 우리가 무엇을 어떻게 언제할지 통제할 수 있는 상태를 뜻한다. 제대로 된 애자일 개발 환경이라면 이러한 것들이 보장되어야 한다. 통달: 더 나은 프로페셔널, 더 나은 인간이 되기 위해 계속 배우고 진화하는 것을 뜻한다. 목적의식: 지금 하고 있는 일이 중요하고 무언가를 더 나아지게 하고 있다고 느끼는 것을 뜻한다. 아무런 이해없이 시키는 대로 일하는 것의 반대 개념이다.

* 애자일을 도입한다는 것은 실무자들에 대한 권한 위임, 변화에 대한 내재화, 협업 증대, 정말로 중요한 것들에 대한 집중, 각 업무들의 가치 이해, 맹목적인 업무의 배제를 시행한다는 것과 같은 의미다. 

* 많은 회사들이 일하는 방식을 개선하지 못하는 이유는 바로 동기가 낮기 떄문이다. 구성원들이 동기 부여가 되어 있지 않고 그들의 일이 어떻게 되든 상관하지 않으면 조직을 변화시킬 방법이 없다.

* 배움의 문화를 만드는 것은 관리자나 애자일 코치의 전담 업무가 아니다. 개발자를 포함해서 모두가 해야 할 일이다. 

* 진정으로 당신을 둘러싼 것들을 바꾸고 싶다면 몇 가지 꼭 갖춰야 할 것이 있다. 가장 중요한 것은 용기다. 동료 개발자, 관리자, 기술 리더와 언성이 높아지는 논쟁을 두려워해서는 안된다. 

* 열정을 보여주는 것으로 부족하다. 무엇보다도 신뢰를 쌓으려면 역량이 있어야 한다.

* 큰 충돌을 피할 수 있는 가장 쉬운 방법은 점진적인 변화를 제안하는 것이다. 

* 가장 근본적인 문제는 싸고 그저 그런 코드로도 충분하다는 매우 잘못된 가정을 할 때가 많다는 것이다. 단기적으로는 그럴 수도 있다. 하지만 중장기적으로는 절대 그렇지 않다. (중략) 쓰레기 더미가 굴러 점점 커지면 싼 것이 더이상 싸지 않게 된다. 버그의 숫자가 늘어나고 새로운 기능을 추가하는 데 시간이 늘어나며 전체 애플리케이션을 다시 만들자는 이야기가 수면 위로 떠오른다.

* 어떤 실행 관례를 배우고 마스터하는 데는 시간이 필요하다. 배우는데 시간이 든다고 해서 그 실행 관례가 나쁘다고 할 수는 없다.

* 리팩토링을 위한 리팩토링은 시간 낭비이다. 할 일이 없어서 시간이 남아 도는 것이 아니라면 특별히 이유도 없이 코드를 열어서 재정리 하는 일은 아무 의미가 없다. 보이스카웃 원칙에서는 '처음 발견했던 것보다 더 깨끗하게' 캠프를 남겨둘 것을 이야기 하고 있지, '캠프 전체를 혀로 핥아도 될 정도로 반짝반짝하게 만들라'는 뜻은 아니다. (중략) 레거시 코드를 대상으로 작업할 때는 최소한 수정한 부분만큼은 원래보다 깨끗하게 만들어 놓아야 한다.

* 단순한 설계를 위한 네 가지 원칙. 모든 테스트의 통과, 중복의 최소화, 명료성의 최대화, 구성요소의 최소화

* 실용주의가 없는 장인정신은 장인정신이 아니다. 장인이 가장 중요하게 초점을 맞추는 것은 고객의 만족이다. 품질은 물론이고 시간과 비용도 고객만족을 위한 구성요소다. 고객에게 가치를 전달할 수 없다면 잘 작성된 코드라고 할 수 없다.

